[{"author":"Aaron Yong","body":"Garbage boosters. I had my 2nd shot, got covid just 2 weeks back, and recovered without issue. Symptoms were nothing more than a bad throat infection and lost of taste. If you're a young adult, You don't need it. That's why some European countries have begun rolling back their mandates. I'd say we're already late in this game.","date":"April 2022","score":"0","source":"fb"},{"author":"Ng Sok Eng","body":"MOH guideline: Persons who have recovered from COVID-19 and have completed their primary series vaccination do not require an additional booster dose at this point in time (with no expiry date).\nIf anyone gets covid, MOH should record and issue discharge memo if you still want to implement VDS. Don't over-medicate by asking people who have acquired natural immunity (especially the mild cases) to go for extra\/\nunnecessary vaccine shots\/boosters.","date":"April 2022","score":"0","source":"fb"},{"author":"KB WR","body":"Lousy booster. Get booster Liao still kena covid. Ffs we get booster for.","date":"April 2022","score":"0","source":"fb"},{"author":"Lena Ang","body":"My neighbour, live in the same block, 1 got stroke, the other cancer, both after 2 jabs, still ask them to go booster, kill them faster?","date":"April 2022","score":"0","source":"fb"},{"author":"Phup","body":"I already got fourth doses of Covid-19 vaccine 💉😷😷🤒","date":"April 2022","score":"0","source":"fb"},{"author":"Jun Yu Ong","body":"Yes.. i know boosters provide better protection.. from official harrassment not covid... until they decide 4th booster is required.. 😁","date":"April 2022","score":"0","source":"fb"},{"author":"Aurelia Elena","body":"Can explain why 9 months to boost and not 12 months? Any stats to show? Annual boost is easier to convince ppl. Bring in Novavax pls....","date":"April 2022","score":"0","source":"fb"},{"author":"Hartley Hartley","body":"Nonsense booster, mostly possitive now a days are those who taken their booster,🤔😷😪","date":"April 2022","score":"0","source":"fb"},{"author":"Marissa Teo","body":"\"...regardless of race, language or religion,...bas\ned on justice an equality...\"\nWe are taught not to discriminate against any race, language or religion. But we discriminate against those who choose not to boost. Is it a just law or an unjust law (as defined by mlk)? The risk\/benefit of the booster varies by age and gender. Can't use one size fits all.","date":"April 2022","score":"0","source":"fb"},{"author":"Pak Adam","body":"Still playing the broken record as more confirmation news comes True. Slow. Very slow.\nUnlike the SINGAPORE system of ahead of everybody...","date":"April 2022","score":"0","source":"fb"},{"author":"Jeff Koh","body":"MOH and MMTF should abide by and respect the National Pledge and ensure justice and equality for all.","date":"April 2022","score":"0","source":"fb"},{"author":"Xiu Yue","body":"so after 14 Feb status changed and cannot lunch out for elderly..","date":"April 2022","score":"0","source":"fb"},{"author":"欣颖","body":"I have friend who took booster liao then kenna covid. End up now lost his taste and smell. Like tt consider mild symptoms?! 🤔","date":"April 2022","score":"0","source":"fb"},{"author":"Derrick Ong","body":"Several countries in europe are dropping vaccine pass, when are you going to drop the VDS discrimination?","date":"April 2022","score":"0","source":"fb"},{"author":"Shan Shan Khoo","body":"Every time we agree to a booster, we are letting go of more of our rights.\n\nGive them and inch and they will take a yard.\n\nVery soon we will be left with nothing, no freedom, no health.","date":"April 2022","score":"0","source":"fb"},{"author":"첸바오링","body":"U, dint even update my status. I, already taken my boosters during last yr Dec. U got the cheek to even remind me to take my booster when ur system failed to update my actually fully vaccinated status.","date":"April 2022","score":"0","source":"fb"},{"author":"Jimmy Lam","body":"I got Myocarditis after my 2nd shot.\nPlease give me exemption.","date":"April 2022","score":"0","source":"fb"},{"author":"Florence Ng","body":"Hope can receive more ART test kit !","date":"April 2022","score":"0","source":"fb"},{"author":"Desmond Chua","body":"Can i bring my 12 year old son without any appointments to vaccine centre to vaccine ?","date":"April 2022","score":"0","source":"fb"},{"author":"Mav Maverick","body":"Something .... no, MANY things are terribly, terribly, terribly, terribly terribly, terribly WRONG and EVIL about our ruling political leaders. What's got into them??? 🤔🤔🤔","date":"April 2022","score":"0","source":"fb"},{"author":"Ricky Ds","body":"Eerr... did anyone get a second and 3rd and 4th.. comparison with incident report studies from those overseas? The reports are totally opposite to what is being stated here... Go research on your own... you will be amazed! Its not surprising that there will be a 4th and 5th and many more boosters with more excuses..🤪","date":"April 2022","score":"0","source":"fb"},{"author":"Acyt Chong","body":"I'm boosted, and still got infected","date":"April 2022","score":"0","source":"fb"},{"author":"Joel Koh","body":"MOH how long do you want to carry on this clown show? How long do you want to sweep vax injuries under the carpet?","date":"April 2022","score":"0","source":"fb"},{"author":"Candy Loong","body":"Booster for what? For me to die ?","date":"April 2022","score":"0","source":"fb"},{"author":"Lwin Moe Khaing Kong","body":"So after booster, no need wear masks ah? If not, what is the point? I'm so angry and tired after 3 years of COVID nonsense. Like Very angry.","date":"April 2022","score":"0","source":"fb"},{"author":"Gipy Deerg","body":"Where is the situation report for 7 Feb? How come not releasing?","date":"April 2022","score":"0","source":"fb"},{"author":"Samsul Alam","body":"MOH my name is Alan Md Samsul, already done by vaccinated two dose, so now I want to take booster dose, so plz as soon as possible to arrange for me sir thank you very much","date":"April 2022","score":"0","source":"fb"},{"author":"Jag Tan","body":"I asked my IT expert whether I can use a 1st generation antivirus to stop a 3rd generation on my computer. He told me to load the antivirus twice but this did not prevent the virus from infecting my computer. The IT expert told me to load the antivirus a 3rd time to solve the problem! I think he is an IT quack! What do you think?","date":"April 2022","score":"0","source":"fb"},{"author":"Mayna San","body":"When I can get the booster vaccine notif","date":"April 2022","score":"0","source":"fb"},{"author":"Jason Wong","body":"bc Pfizer stock price also needs a booster?","date":"April 2022","score":"0","source":"fb"},{"author":"Christina Tham","body":"What blasphemy is this","date":"April 2022","score":"0","source":"fb"},{"author":"Iris Koh","body":"How many boosters are lined up? Please be upfront and honest with the people.","date":"April 2022","score":"0","source":"fb"},{"author":"Shah Nizam","body":"Thursday booster\nSunday positive\n\nPlease advise MOH?","date":"April 2022","score":"0","source":"fb"},{"author":"Bahtiar Affendy Erna","body":"💯🇸🇬👍🏻👍🏽👍👍🏼🎯","date":"April 2022","score":"0","source":"fb"},{"author":"Jasmine Poh","body":"Can upgrade or not? Give turbocharged instead of booster only. Double the dose, don't be stingy with vaccine","date":"April 2022","score":"0","source":"fb"},{"author":"Isabella Bratz","body":"For people who do not want to get \"better protection\", can they skip boosters and be allowed to live a normal life instead of being treated like social pariah? Just curious.","date":"April 2022","score":"0","source":"fb"},{"author":"Jay Jay","body":"Take your booster as soon as you are eligible!Before\nyou lose your job and cant go to shopping mall.Your health dont matter as the current as the booster is not working and daddy pfizer is clearing way for omicron variant coming soon. so ppl get the snake oil made for the alpha variant to keep your vacc passport.","date":"April 2022","score":"0","source":"fb"},{"author":"Paul Lim","body":"A very important and excellent video on how Pfizer grossly manipulated the trials to cover up all the harmful side effects of the vaccine, presented by a group of 500 Canadian doctors and scientists.","date":"April 2022","score":"0","source":"fb"},{"author":"Boonsuan Khoo","body":"For recovered Singaporean who got covid oversea, where can we upload our result so that we can delay our booster shot?","date":"April 2022","score":"0","source":"fb"},{"author":"Peter Png","body":"Is this really MoH FB? They not replying to any of the concerns here. Hmm.","date":"April 2022","score":"0","source":"fb"},{"author":"Max Wang","body":"Hi MOH, is it true that Singapore have signed a secret contract with Pfizer? Do you have the details of this contract?","date":"April 2022","score":"0","source":"fb"},{"author":"Benson Jk","body":"No thanks! How many more to take?","date":"April 2022","score":"0","source":"fb"},{"author":"Jimmy Lam","body":"The minute they hand you the vaccine passport,\nEvery right that you have is transformed into a privilege contingent upon your obedience to arbitrary government dictatorship.\n\nYour human rights and freedom come with an expiry and renewal date.","date":"April 2022","score":"0","source":"fb"},{"author":"Estelle Young","body":"After jab in Aug 2021, I developed a fast heart rate within a week which is still not resolved till today, 5 months later. Last heart rate taken at hosp was 116 bpm sitting and simply walking would bring my heart rate up to 150 bpm. However, none of the doctors reported my injury as there is \"no evidence it is vaccine-related\n\" even though it happened WITHIN THE WEEK of the shot. No prior health conditions.\n\nWhen I went to A&E, the doc mentioned many people have been coming in for chest pain, heart palpitations and high heart rate after vax. How long and how many vaccine injuries have gone unreported? Why does it seem like they are sweeping it under the carpet?","date":"April 2022","score":"0","source":"fb"},{"author":"Roopi Singh","body":"Fed up of booster doses.The whole body is going to be filled up with unnecessary chemicals.Even after 3 or 4 doses people still getting covid so it should be treated like normal flu and let people have natural immunity.\nAll the vaccines should be optional.Whoeve\nr wants to go, can go.","date":"April 2022","score":"0","source":"fb"},{"author":"Yogini Yoga","body":"Who to contact as receiving SMS messages on booster for a child. It's to a wrong number. Have left messages at the 1800 number but still receiving sms's. Please advise.","date":"April 2022","score":"0","source":"fb"},{"author":"QX Mai","body":"Mucus vs Vaccines\n\nI never really appreciate my mucus before until Covid 19 emerges.\n\nDuring cold weather especially early morning my body will produce \"tonnes\" of mucus and fill up my nose to the degree I'm not breathable.\n\nAs I grew up, nose congestion has started to minimize but my body was still able to produce excessive mucus when needed.\n\nMucus plays an important role in keeping us healthy.\n\nMucus is the interface between us and the outside world.\n\nMucus lines the moist surfaces of our body like the lungs, sinuses, mouth, stomach, and intestines.\n\nIt serves as a line of defense - because anything that you breathe in gets stuck in the mucus.\n\nBacteria land on the mucus-lined surface of the lungs will get trapped.\n\nIn a normal healthy body the little hairs called cilia will push the mucus up and out of the lungs with all the trapped bacteria, viruses, and dust.\n\nSince both our nose & our mouth is the key entry point for Covid 19 virus, peoples with excessive mucus in both the nose and mouth (me) will stop the advancement of the virus through our lungs.\n\nIf the majority of the people are not able to produce excessive mucus then MOH may have to create some sort of nasal vaccine because the nasal vaccine is more robust than an injected vaccine.\n\nAs the saying goes \"Prevention (nasal vaccine) is better than Cure (injected vaccine)\".\n\nor...\n\nThe Yellow Emperor's Classics of Internal Medicine once says:\n\nTo apply medicine to disease after it is already developed, or to suppress a revolt that is well expanded, is like digging a well when one already feels thirsty, or forging weapons when a war has already started, don't you think is too late?","date":"April 2022","score":"0","source":"fb"},{"author":"Rasel","body":"I’m covid-19 recovered and received 1dose of mRNA\n\nI went to take booster last months and vaccination Center doctor said I no need to take any booster\n\nIf now I wants to take how I should book appointment ,is there any link ?\nOr where I should go to take booster","date":"April 2022","score":"0","source":"fb"},{"author":"Swee Swee","body":"Doctors, media, policr , judge all under one roof. What do u think","date":"April 2022","score":"0","source":"fb"},{"author":"Wanling Huang","body":"How about after take booster then after that get covid ?","date":"April 2022","score":"0","source":"fb"},{"author":"Yoshiko Lim","body":"Why MOH override your own doctors who assessed patients as medically ineligible for any jabs, and then force take mRNA for adverse effect to fill up MOH form????","date":"April 2022","score":"0","source":"fb"},{"author":"Idris Arkette","body":"1. Is MOH still giving out the circular that states pfizer has a 95% efficacy?\n\n2. News has come out that natural immunity is stronger than vaccines, why is MOH not promoting this, but rather hell-bent on pushing vaccines with a questionable longterm safety profile?\n\n3. In Israel 80% of those in ICU are vaccinated, what is the percentage of Singaporeans who are fully vaccinated and in ICU?","date":"April 2022","score":"0","source":"fb"},{"author":"Shepherd Man","body":"Hi MOH, my humble opinion is that once you got covid-19 and recovered from it, you acquired natural immunity. Appreciate very much if MOH can waive the requirement for booster shot for this instance.","date":"April 2022","score":"0","source":"fb"},{"author":"Merrayell Low","body":"Israel share similar demographic as Singapore and their ministry of Health have Already admitted that the jab and booster was a failure.. they have stop all requirements for the Jab and remove differentiate measures. So why are we still being force to jab? And jab for the sake of keeping our jobs and being able to go buy groceries, ain't a medical jab especially if term as vaccine suppose to protect with little or zero side effects.","date":"April 2022","score":"0","source":"fb"},{"author":"Abel Tan","body":"Please read the book “the truth about covid-19” by dr mercola. He talks about how counterproducti\nve vaccines can be. This book is not available in public libraries, for obvious reason. Also remember the old lady who died a few days after her 4th shot !!!","date":"April 2022","score":"0","source":"fb"},{"author":"দুঃখ কষ্টের জীবন","body":"I already done booster dose December date-4.\/ 21","date":"April 2022","score":"0","source":"fb"},{"author":"Acer Acer","body":"At a recent a&e visit, the sgh emergency dr told us that the medical staff was jabbed separately from the general population.\n\nThen perhaps their jabs are the placebo, that's why they didn't report serious side effects?","date":"April 2022","score":"0","source":"fb"},{"author":"Gipy Deerg","body":"What is happening? Why more fully vaccinated ppl are in ICU than unvax? Looks like need more booster.","date":"April 2022","score":"0","source":"fb"},{"author":"Surya Sufyan","body":"They are farming you.\n\nFeed you with poison so they can reap the rewards of their efforts.\n\nHow many people permanently injured from the jab and now need constant medical care???\n\nYou guys are criminals and one day you will be brought to justice.","date":"April 2022","score":"0","source":"fb"},{"author":"Kim Ong Toh","body":"F","date":"April 2022","score":"0","source":"fb"},{"author":"Daniel Tan","body":"It feels like Singaporeans' lives don't matter at all..\nToo many people infected.. more will die.. for what end?","date":"April 2022","score":"0","source":"fb"}]