[{"author":"Chen Anatta","body":"After 3rd dose of pfizer, I experienced shortness of breath at the end of 2nd weeks. The symptoms persists after a month since the first episode.\n\nAt first, Want to call post vaccine hotline? No hotline.\n\nWent to gp, gp said may not be related to vaccine.\n\nWent to pulmonologist, doctor said it's getting common after people are vaccinated (booster). Air ways are more sensitive.i was given meds and asthma medicine, symptoms not clear but slightly better.\n\nNot sure if anyone else encounter similar post vaccine (booster) issues but it seems to me too much vaccines can be risky.\n\nNote: what eventually helps is plenty of rest and TCM. Changing diet to Low carb and no caffeine. Symptoms not clear but improving.","date":"April 2022","score":"0","source":"fb"},{"author":"Vivien Tan","body":"Do boosters help? So many of my friends who had boosters had Covid recently, some within 2-3 weeks after boostering. Over CNY period, all of my family members who are FV had Covid except me. I’m only PV cos the wonderful Pfizer vaccine has given me vaccine injuries for more than 6 mths. If the jabs really work, there’s no reason why I’m Covid free when I had so much direct contact with 3 infected family members staying in same household. I should be in ICU or dead now as claimed by MOH!","date":"April 2022","score":"0","source":"fb"},{"author":"金红","body":"Why never mention about serious risks of chest and join pain or even die after being jabbed ? Who will be responsible for it? Underlying conditions?","date":"April 2022","score":"0","source":"fb"},{"author":"Ser Ming","body":"If I choose not to take the booster shot and willingly okay to have my vax status to turn into unvaccinated, will that affect me reporting for my in-camp training?","date":"April 2022","score":"0","source":"fb"},{"author":"Tan Yi Fang","body":"How come 5 months? Don’t confuse people please. It’s 270 days.","date":"April 2022","score":"0","source":"fb"},{"author":"Cynderella Bakes","body":"Only no if you are dead","date":"April 2022","score":"0","source":"fb"},{"author":"Cynderella Bakes","body":"Now your TT shows expiry date to work and live life ! How wonderful ❤","date":"April 2022","score":"0","source":"fb"},{"author":"Aurelia Elena","body":"Please expedite Novavax shipment, my 9 months almost up. Majority of us have mRNA as the based jabs, so now we need non-mRNA booster to be readily open up to the public, w\/o the need for doc's memo. Give us the flexibility when u wanna open up further.","date":"April 2022","score":"0","source":"fb"},{"author":"Binte Munavar","body":"I take 2nd dose after one month irregular mensuration side effects (include horrible pain )every month , brain not working most of time , sometime high bp, heart beat fast & difficult to breathe. So i dont want take risk for my life of booster.","date":"April 2022","score":"0","source":"fb"},{"author":"Kale Lim","body":"From 270 days to 5 months? Did they change the period or their math fail? 270 days is 9 months, no???","date":"April 2022","score":"0","source":"fb"},{"author":"Gin Ong","body":"I had 2 Pfizer vaccination. After 1st vaccination I had a minor stroke which I overcome due to unwareness. After 2nd vaccination I had a really bad one with severe headache, slurred speech and weakbody. Was admitted to Changi Hospital for 8 days . Luckily doctor said the blood clot was dissolving so don’t need to do surgery. When I query the doctor, they said is due to my underlying health problems which is very mild and well controlled throughout the years. The booster I went for the sinopharm, luckily there was no injury but till today I am feeling very weak. So how to explain when they said is my problem? 🤔","date":"April 2022","score":"0","source":"fb"},{"author":"Ivy Tan","body":"What about those of us who suffered vaccine injury? Are you asking us to risk our lives with every jab... to maintain vax status?","date":"April 2022","score":"0","source":"fb"},{"author":"Siew Lee Lek","body":"MOH - u r making everyone confusing on 5mth n 9mth. How will it impact the vaccine status of individual. Give examples to explain to all. We are not as highly educated than u guys sitting there","date":"April 2022","score":"0","source":"fb"},{"author":"Jasmine M","body":"Most countries are dropping vaccine mandates, let alone booster mandates. Why are we taking the same precautions as a year and a half ago when the virus is minor than what it was? Let those who want to take the booster take it. The majority of us have been vaccinated, that is enough. The rest of the world has started to open up, why are we continuously taking steps backwards?","date":"April 2022","score":"0","source":"fb"},{"author":"Joline Lim","body":"Is MOH is taking these comments to heart or simply using FB as advertising space?\n\nReal people are crying foul and what do you continue to do? Stop playing a part in pushing these poisons into our bodies and supporting the punishing of those who choose to speak up. It’s unethical and violates our right to choose what we put into our bodies.\n\nIf you’re reading this my fellow citizens, esp those who have been affected - we can stop this madness if we stand together and refuse to take these shots. We HAVE TO band together!\n\nMy sincere plea to the medical professionals who know what’s going on - please search your hearts and do the right thing. Please be on the side of the people - countless lives are at stake, the children included.","date":"April 2022","score":"0","source":"fb"},{"author":"JC Tan","body":"Booster doesn't mean better. I got COVID the same day as my friend. He was recovered in less than 3 days and didn't have his booster. I had mine and still positive on the 4th day","date":"April 2022","score":"0","source":"fb"},{"author":"Justin Ian Poh","body":"In this case I will drag until the 8th month to take my booster. Y take booster early when it has turned redundant?\n\nIt shows hw pathetic the G is for her ppl to take boosters not because of a genuine consideration of personal health but because failure to do so will be denied freedom n work.\n\nI wonder if the G realises this.","date":"April 2022","score":"0","source":"fb"},{"author":"Kelvin Tan","body":"many elderly even well educated one are telling me that by 14th is the end for those did not take a booster. I tried explaining the 270 days window to them but they say government say 14th all need booster. Company is also setting policies by 14th those not booster shot cannot go work and seems to ignore the 270days. Pretty screw up the info did not get thru to general citizen and all jus hear the 14th Feb date is the end. Let's see on tmrw if my status will change on the tt if it will be screwed up as well. I'm not yet 270 days and my wife is not even eligible for booster yet. Trying to drag it out as long as possible hopefully to get 1 shot less if there will be 4th 5th or 6th shot or when it become a yearly anti virus update. Maybe the vaccine companies will sell countries vaccine as subscription model to get the latest update and all.","date":"April 2022","score":"0","source":"fb"},{"author":"文斯锡安","body":"Don't confuse pple. Last dose of primary series is more than 9 months then take booster and not 5 months which is shown on picture.","date":"April 2022","score":"0","source":"fb"},{"author":"WK Seah","body":"Dear MoH, the picture is cool and all, but can I treat purple shot = blue shot. This is important question because I need to make UI changes for this.","date":"April 2022","score":"0","source":"fb"},{"author":"Jubayer Ahmed Juber","body":"I have one dose only moderna vaccines that time I am recovered so now what I need to do...","date":"April 2022","score":"0","source":"fb"},{"author":"Busu Shanimfamily","body":"True.. I take 2nd dose effect all my heart cramps always. Now haven't booster I'm scary.. think if I sick who want to care my children baby's 😥","date":"April 2022","score":"0","source":"fb"},{"author":"Laura Yuan","body":"Hi anyone whose status has become additional dose required today? My family n I got covid on 15 Jan. The doc at the clinic only did art for us as per their protocol 2.\nHowever my hubby lost his green vaccination status today. Called MOH but all they can do is to ask us to fill a form n to call up the clinic for a recovery memo.","date":"April 2022","score":"0","source":"fb"},{"author":"Yap Chia","body":"May I know how many more boosters we need for the next few years? Or we need one booster every year?\n\nWhy Moh don't ask pfizer why they need 75 years to tell us the vaccine data?\nI already dead by 2096.\n\nI know Moh will never reply, we are wasting time to comment here.","date":"April 2022","score":"0","source":"fb"},{"author":"Lim May","body":"Why they keep pushing even people haven't reach 5 months after 2nd dose. I received 2 emails from moh when I only had my 2nd jab in October","date":"April 2022","score":"0","source":"fb"},{"author":"Xinying Joxin","body":"But my vaccination status is still based on my 2nd dose leh. So keep asking ppl take booster for what?! Status also don't change.","date":"April 2022","score":"0","source":"fb"},{"author":"Yvonne Foo","body":"Dear MOH, please kindly do not halt teachers' lessons on weekdays. Two days no lessons because vaccination days at early intervention schools\/\ncentres. Parents who want to jab their children please do it over the weekends and not agree to allow them to do it when kids should be having lessons. It's disruptive.","date":"April 2022","score":"0","source":"fb"},{"author":"Nashir Uddin","body":"My 2nd dose moderna is already 7month. Today i go kranji vaccination centre the says no appointment no give. Its true? No appointment cant take the booster dose.","date":"April 2022","score":"0","source":"fb"},{"author":"Jane Chua","body":"MOH please fix your calculator's glitch. Unable to proceed although instruction says skip question if dose 3 is N\/A.","date":"April 2022","score":"0","source":"fb"},{"author":"Rahimah Mohd Som","body":"I just done my third Sinovac jab yesterday. I was advised to get the 4the jab, 9 months or 270 days later.\nHere it indicated as 3 months.\nAppreciate if anyone can clarify this.\n\nThank you","date":"April 2022","score":"0","source":"fb"},{"author":"Lea Vdanz","body":"I've got my booster Pfizer on 8 Dec 21,my previous 2 dose is mRNA,my body is good with 2 dose,bt after booster until now my body easily get weak n tired n sometimes feel giddy 😔","date":"April 2022","score":"0","source":"fb"},{"author":"Yluienng Clhooing","body":"I'm just curious, how many people here who keep saying they won't take booster, have ACTUALLY taken the booster?\n\nImagine everybody make a stand against no booster shot. Surely the govt would listen no? Or I'm too naive 🤔","date":"April 2022","score":"0","source":"fb"},{"author":"Shilonggang South","body":"The instruction is already very clear!!!! It is compulsory to go for booster, otherwise, you can't go anywhere at all!!!!","date":"April 2022","score":"0","source":"fb"},{"author":"Queenie Queenie","body":"Since they have gathered what people have experienced they are suppose to find more solutions. Combined with TCM and supplements it may help. See what kind of physical activities people cannot do... plenty of rest and more for a short period of time until body conditions are bad to normal.","date":"April 2022","score":"0","source":"fb"},{"author":"Twinkai PipooWang","body":"Why cannot be more simplified primary series is mean second dose.","date":"April 2022","score":"0","source":"fb"},{"author":"Kymmie Ng","body":"Keep ask for booster ，but case keep\nGoing up !","date":"April 2022","score":"0","source":"fb"},{"author":"Lim May","body":"My brother got covid after his booster","date":"April 2022","score":"0","source":"fb"},{"author":"Patrick Zhang","body":"If Vaccination Status can prevent severe illnesses, why are there so many cases in the hospitals?","date":"April 2022","score":"0","source":"fb"},{"author":"Guo XF","body":"Change again? I thought after 3rd dose is 270days. Kept changing no wonder ppl say the ministry are prata management.","date":"April 2022","score":"0","source":"fb"},{"author":"Joanna Chng","body":"Hmmmm.....I wonder if after Feb 14th the number of unvaxxed rises due to people not taking up the gov's generous offer of lifelong boosters??","date":"April 2022","score":"0","source":"fb"},{"author":"Imran Becks","body":"After this there'll surely be another booster shot we need to take. Never ending 😑","date":"April 2022","score":"0","source":"fb"},{"author":"力池理嗷","body":"Your Chart needs to also include recent infection as a category. Best not to create blindspots by omiiting it out","date":"April 2022","score":"0","source":"fb"},{"author":"Mohd Sopie Azizan","body":"Wow in Malaysia u only have to wait 3 months after second dose pfizer to get booster dose.","date":"April 2022","score":"0","source":"fb"},{"author":"Jimmy Yap","body":"Wil I be stronger if I boost every week? I wan be super immune","date":"April 2022","score":"0","source":"fb"},{"author":"Sam Diamante","body":"I got my booster not even 5 months after my second pfizer vaccine","date":"April 2022","score":"0","source":"fb"},{"author":"Liow Oi Lian","body":"So my Trace together App show Vaccination status valid till 2 July 2022. Is it still valid or overide expired on 15Feb 2022? Appreciate someone explain this.","date":"April 2022","score":"0","source":"fb"},{"author":"Puo Her","body":"So Booster is to remain maintain vaccination status ?","date":"April 2022","score":"0","source":"fb"},{"author":"Wong LS","body":"People are forced to boost to keep the vaccination status but the vaccine effectiveness will wane after 4 months","date":"April 2022","score":"0","source":"fb"},{"author":"Lin Yihui Sharon","body":"Can you please refer to WHO?","date":"April 2022","score":"0","source":"fb"},{"author":"Celine Chong","body":"Can stop making the vaccination mandate.\nJust follow Japan, allow the citizens to decide base on their own health, whether to take the vaccination anot….","date":"April 2022","score":"0","source":"fb"},{"author":"Yim Yim","body":"If tested +ve after 2 doses.....do i need to take booster?","date":"April 2022","score":"0","source":"fb"},{"author":"Lucile Lauron Garao","body":"I'm here in Philippines can I get my booster when I come back to Singapore,I'm still here in Phil for my holiday","date":"April 2022","score":"0","source":"fb"},{"author":"Toh Chin Nan","body":"I am a vaccine inured. Decide if you want to take, it’s your life.","date":"April 2022","score":"0","source":"fb"},{"author":"Shelly Kia","body":"Can kindly advice if recovered person still need booster? If don’t need, is there any time frame that booster should be taken after recovered?","date":"April 2022","score":"0","source":"fb"},{"author":"Ce Ci Lle","body":"Hiw about... i got only 1vaccine.... coz they said i am recovered from covid...but i didnt know about it","date":"April 2022","score":"0","source":"fb"},{"author":"Linus Chua","body":"Hi, I had my 2 doses last year and was tested positive last week (7 Feb) and documented the infection at a clinic. However, my trace together today says additional 1 dose needed. What should I do?","date":"April 2022","score":"0","source":"fb"},{"author":"Gabor Nagy","body":"I am not taking any useless booster jabs, go pound sand.","date":"April 2022","score":"0","source":"fb"},{"author":"Amanda Fok","body":"Keep probing me to input the details which I don't have. How to give details when I have not gone for booster?","date":"April 2022","score":"0","source":"fb"},{"author":"Dan Aiden","body":"MOH only do one thing and that is to keep boostering? Thats all they can come up with? 🤣","date":"April 2022","score":"0","source":"fb"},{"author":"Guo Wendy","body":"I can feel my immunity weaker after 3rd shot. Does anyone feel the same ?","date":"April 2022","score":"0","source":"fb"},{"author":"Adeline Poh","body":"If got covid19 when can we take the booster","date":"April 2022","score":"0","source":"fb"},{"author":"Alvin Tay","body":"Hope you can review on the processes for vaccination Centre at clementi community centre. Appt at 8pm nearly 9pm still waiting to get vaccine. Compare Hong Kah North community club as there were no delay. Not sure what appt use for?","date":"April 2022","score":"0","source":"fb"},{"author":"Khuan Seng","body":"Do I need to take a serology test if I have my booster shot overseas?","date":"April 2022","score":"0","source":"fb"},{"author":"Chee Yoon Tan","body":"I had 2 doses of Pfizer and 1 dose of Sinopharm.","date":"April 2022","score":"0","source":"fb"},{"author":"Md Azad","body":"recovery 1 dose complete this person doing what.","date":"April 2022","score":"0","source":"fb"},{"author":"Chan Sher Lin","body":"2 primary doses + 1 booster + covid infection = Life long covid immunity or not?","date":"April 2022","score":"0","source":"fb"},{"author":"Edmund Oh","body":"How about those who recovered from COVID?\nI had my primary series plus booster then I had COVID. Do I need to get a booster 90days later?","date":"April 2022","score":"0","source":"fb"},{"author":"Ng Yong Da","body":"My First Sinopharm vaccination was on 1 November 2021 ( Wednesday ) and my Second Sinopharm vaccination was exactly 1 month later on 1 December 2021 ( Wednesday ) . As I understand that Sinopharm vaccination is a three dose regime , I will have to take a third Sinopharm vaccination three months after my Second Sinopharm vaccination to complete the primary series of my Sinopharm vaccination .\nThen I will have to take a booster vaccination three months after my third Sinopharm vaccination . Can my booster shot be the same as my first three doses which is Sinopharm vaccine ? Or can I take Sinovac vaccine if I do not want my booster shot to be an MRNA vaccine ?\n\nMust my booster shot definitely have to be a vaccine that is under the National Vaccination Programme which is MRNA vaccine ( either Pfizer or Moderna ) or Sinovac ( which is a non - MRNA ) vaccine ?","date":"April 2022","score":"0","source":"fb"},{"author":"Grace Tan","body":"How about those recovered from Covid?\nDo they need to get a booster?","date":"April 2022","score":"0","source":"fb"},{"author":"Kamini Devi","body":"Basically a yes to all! 😂","date":"April 2022","score":"0","source":"fb"},{"author":"Taylor Tan","body":"Jab 1, 2 no effect but Jab 3 almost claim half my life and i will curse everyday on the team that decides to forcefully inject poison for my body!","date":"April 2022","score":"0","source":"fb"},{"author":"Sunny Low","body":"Should publish this MOH info in our 4 official languages. 😃","date":"April 2022","score":"0","source":"fb"},{"author":"Marissa Teo","body":"Booster benefits 65+ greatly, and those with co morbidities. But benefits are minimal for the young and healthy and could be harmful (boys, men).\n\nMOH: Is risk stratification so difficult to implement? Isn't that basic healthcare?\nThe reputation of US CDC is going down the drain. Don't follow that path. Why not look at what the Nordic countries are recommending.","date":"April 2022","score":"0","source":"fb"},{"author":"Felix Wong","body":"Ministry of Health, Singapore Gan Kim Yong your document show Sinovac and Sinopharm after 3 jab, require booster in 3months time. I took Sinopharm but my App shows 5months for booster after primary series completed. Can MOH clarify as it causing confusion","date":"April 2022","score":"0","source":"fb"},{"author":"Woshiwasabi Wataru","body":"For Sinovac, why 3 months after the third jab whilst the rest are 5 months??? Typo error?","date":"April 2022","score":"0","source":"fb"},{"author":"Mitch Yogen","body":"Not sure if you realised but the second column is unnecessary.","date":"April 2022","score":"0","source":"fb"},{"author":"Constella Sun","body":"How to get invited for booster jab?","date":"April 2022","score":"0","source":"fb"},{"author":"Joseph Chin","body":"How many times do you need a person to boost? Boost until i die?","date":"April 2022","score":"0","source":"fb"},{"author":"Elton Lemons","body":"The caption should be \"when do you need your booster shot?\"","date":"April 2022","score":"0","source":"fb"},{"author":"Whimsy Cat","body":"Helper also need booster shot?","date":"April 2022","score":"0","source":"fb"},{"author":"Irvin Lee","body":"How to Enter raffles city Malll to take my booters, now JAB LOGO Gone. HOW TO ENTER? Raffles city can walk in jab or via Appt?","date":"April 2022","score":"0","source":"fb"},{"author":"BillytheKid NedKelly","body":"Y sometimes i'm told its 5 mths after 2nd dose n sometimes i'm told 9 mths after 2nd dose????..so when do i take my booster shot? 5 or 9 mthz after 2nd dose??????.","date":"April 2022","score":"0","source":"fb"},{"author":"Shong Thao","body":"lol no option for NO #pharmasellout","date":"April 2022","score":"0","source":"fb"},{"author":"Tang NG","body":"Why is it in a hurry to take jab just after 5 mths?","date":"April 2022","score":"0","source":"fb"},{"author":"Nige Woolley","body":"What a waste of time. What guarentee are you giving. If 2 jabs are not working. How many more will make it work & what's in the booster shot thst aids the protection that isn't in the 1st 2 jabs","date":"April 2022","score":"0","source":"fb"},{"author":"Jeffrey Lim","body":"You expect us to jab Sinopharm every 3 months? LMAO","date":"April 2022","score":"0","source":"fb"},{"author":"Myint Johnny Michelle","body":"Asthma and medicine allergy can vaccine?","date":"April 2022","score":"0","source":"fb"},{"author":"Laurence Lau","body":"Can I get my 4th jab of Pfizer after how many months of 3rd jab of Pfizer?","date":"April 2022","score":"0","source":"fb"},{"author":"Azahan SK","body":"Abdullah Jamadi Muhammad Abdullah negara sebelah dah yg ke 4 dah 😂😂😂😂","date":"April 2022","score":"0","source":"fb"},{"author":"Em Wida","body":"Vaccine or no vaccine also same still can kena. Last time say only 2dose now say booster jab lah 4th booster coming lah.. twist and turn like prata!","date":"April 2022","score":"0","source":"fb"},{"author":"Kelly Mod","body":"So For Unvaccinated still tested Negative to this day still cannot go back office work? Any Protocol? Target? Any Science data to back up this forever decision? What is the reasoning? Is there an end to this restriction for non fully vaccinated survivors with natural immunity to return to normal lives as a honest tax paying citizen? Any updates on this?","date":"April 2022","score":"0","source":"fb"},{"author":"Gwenn Selvam","body":"How abt those who had nothing???","date":"April 2022","score":"0","source":"fb"},{"author":"Jasmine Poh","body":"I am armed with turbocharged shot 👍","date":"April 2022","score":"0","source":"fb"},{"author":"Kelvin Koay","body":"Sky Saw Sky Saw Jeffrey Yan","date":"April 2022","score":"0","source":"fb"},{"author":"Acer Acer","body":"The PAP and MTF are already shameless to the extent that they don't care what people think of them...","date":"April 2022","score":"0","source":"fb"},{"author":"Skyblkbly Dem","body":"At this point, MOH must be insane to continue to push these dangerous substance.","date":"April 2022","score":"0","source":"fb"},{"author":"Pui Kei A-u","body":"Pui San Au 4th jab?","date":"April 2022","score":"0","source":"fb"},{"author":"Jason Soh","body":"Really stupid information!\nHad 2 jabs, self art positive is not recognised unless is certified by doctor. In the 1st place your agency should ask all to see doctor to get it certified. We are paying millions and we still get idiots!","date":"April 2022","score":"0","source":"fb"},{"author":"Feby Natalia","body":"Yesterday I'm 3rd dose vaccine already.\nI'm from Indonesia Batam,1 dose my vaccine astrazeneca.3 months in Singapore I get 3rd dose vaccine booster.\nThank you MOH Singapore 🥰","date":"April 2022","score":"0","source":"fb"},{"author":"Phua Kelly","body":"Today's overtime pay is double because work on Off day and on Weekend. Triple for some that act on \"Like\" faster.\n\nTomorrow, your bosses will smile at you, also?","date":"April 2022","score":"0","source":"fb"},{"author":"Dave Aurelius Chen","body":"Booster your mother","date":"April 2022","score":"0","source":"fb"},{"author":"Man Nii","body":"conspiracy theories ppl be like","date":"April 2022","score":"0","source":"fb"},{"author":"Daniel Martin Sebastian","body":"Updated mine in the TraceTogether app\n\nAll good - fully vaccinated (3 doses)","date":"April 2022","score":"0","source":"fb"},{"author":"Zachary Boon","body":"I have taken my 3rd booster shot after the Singapore Airshow was over","date":"April 2022","score":"0","source":"fb"},{"author":"Jona Giray","body":"Please consider the long term side effects of multiple boosters in a year before mandating..we are humans. Not guinea pigs or test labs. Its a human being you guys are touching.","date":"April 2022","score":"0","source":"fb"},{"author":"Pak Adam","body":"No. These are useless. Plus an optional nnecessary pain in the arm. How many jabs every year ? 3-4 ?","date":"April 2022","score":"0","source":"fb"},{"author":"Eng Lee","body":"Misleading \"advertising\"!!\nIt's 270 days and not 5 months! disgusting the way you go about it to mislead and confuse.","date":"April 2022","score":"0","source":"fb"},{"author":"Sandrine Traut","body":"I dont think the booster is necessary. Your body remembers the 2 shots received before even if the antigen quantity is lower. It is actually rather dangerous to continue injecting people with the booster. You dont know the after effects in few years. After booster you are already fighting the virus so you are more lickely to actually fall sick...... Now the virus is just like a flu so booster shouldnt be mandatory....","date":"April 2022","score":"0","source":"fb"},{"author":"Adoo Wc","body":"MOH, what is Singapore direction in vaccination? Annual jab?","date":"April 2022","score":"0","source":"fb"},{"author":"Dean Ang","body":"Before asking people to take more booster, better think first what you can offer to the people, where is promise for \"flatten the curve\" ?","date":"April 2022","score":"0","source":"fb"},{"author":"Adoo Wc","body":"Vaccine goalposts keep changing. Remember what OYK said before. 2 jabs considered fully vaccinated. Now booster considered fully vaccinated. Next coming every 270 days booster considered fully vaccinated .","date":"April 2022","score":"0","source":"fb"},{"author":"Florence Tan","body":"Florence Tan","date":"April 2022","score":"0","source":"fb"},{"author":"Viknesh Kalithas","body":"Kala Asokan","date":"April 2022","score":"0","source":"fb"},{"author":"Yumei Zhg","body":"Yumei Zhg","date":"April 2022","score":"0","source":"fb"},{"author":"Wong Yew Chuen","body":"Tenzin Jigme Kien Wong","date":"April 2022","score":"0","source":"fb"},{"author":"Dayana Aurora","body":"Hairil Jafar","date":"April 2022","score":"0","source":"fb"},{"author":"Surendran Verasena","body":"Surendran Verasena","date":"April 2022","score":"0","source":"fb"},{"author":"Joey Wong","body":"Jesus Beloved","date":"April 2022","score":"0","source":"fb"},{"author":"Puan Fridha","body":"Emaan Salle Fraij","date":"April 2022","score":"0","source":"fb"},{"author":"Rowe NA","body":"Jljjag Belle","date":"April 2022","score":"0","source":"fb"}]