[{"author":"John Miller","body":"I literally had no affects after the original two doses plus the booster. I received the Pfizer vaccine each time.","date":"April 2022","score":"0","source":"fb"},{"author":"Fraulein Fugate Adkins","body":"I had the Moderna vaccine and no side effects from any of them other than feeling off for a few hours. I actually had a burst of energy on the 2nd shot at 4 a.m. last April 😆 well I did have a sore arm each time but that's to be expected with any shot","date":"April 2022","score":"0","source":"fb"},{"author":"Allen Gregg","body":"Slightly sore arm after my Moderna booster. That was it. Contrary to what Fox anchors may say, I did not grow a third eye, develop odd mental abilities, or grow scales in private areas.","date":"April 2022","score":"0","source":"fb"},{"author":"Nancy Graham","body":"I had Pfizer for all three. I was so sick I thought I was going to die. Left security off and front door unlocked over night in case I had to call 911. Chills so bad I could not write down vitals I was taking. High heart rate. Pretty scary.","date":"April 2022","score":"0","source":"fb"},{"author":"Lyudmila Mihajlovna","body":"Got my moderna while pregnant. Did not experience any side effects whatsoever, just some muscle soreness after the needle poke. Me and baby are healthy ❤️","date":"April 2022","score":"0","source":"fb"},{"author":"Ron Baxter","body":"I for one will not be taken this vaccine until I know long term effects.","date":"April 2022","score":"0","source":"fb"},{"author":"Sherry Blanton Vandersteen","body":"Who cares I would do it again in a minute. The security and relief of not dieing is worth feeling a little sick for a day.","date":"April 2022","score":"0","source":"fb"},{"author":"BobbyJo Sawyer Newell","body":"My symptoms of having omicron are exactly the side affects of the shot. Feels like a bad cold. Stay well everyone.","date":"April 2022","score":"0","source":"fb"},{"author":"Ginny Strickland","body":"covid in February gave me chronic dizziness lightheaded spells multiple times a day. Decided to get the shots was improving But then got the second shot which was in april I have dealt with debilitating dizziness daily I cant work my husband is out of work to help me and the kids. Prior to covid and the shots I was an active healthy 34 year old. Im pro vaccine but more research and advocacy for people like me I feel is necessary!","date":"April 2022","score":"0","source":"fb"},{"author":"Taylor Hamlin","body":"Give a complete list. Strokes, blood clots, menstration irregularities,\ninflammation of vascular system\/heart, t-cell response reduction. Informed consent is standard with other vaccines or medications, why is this different? Even the ADVERTISEMENTS for prescription drugs list off side effects that are often worse than the disease.","date":"April 2022","score":"0","source":"fb"},{"author":"Sandra Wright","body":"I'll take minor side effects anytime over a ventilator or even death.","date":"April 2022","score":"0","source":"fb"},{"author":"Karen Robertson Steinberg","body":"Three week severe headache! I begged to die it was so intense. Required 2 rounds of steroids. 3 providers told me not to get any more shots.","date":"April 2022","score":"0","source":"fb"},{"author":"Diann Yacullo-Ancey","body":"WHERE IS THE REAL DATA FOR NATURAL IMMUNITY?","date":"April 2022","score":"0","source":"fb"},{"author":"Sally West Lindsey","body":"I call bs on the whole vaccine delima. Wouldn't touch it with a ten foot, make that thousand foot pole. Anyone that thinks it's beneficial and in your best interest, is sadly mistaken.","date":"April 2022","score":"0","source":"fb"},{"author":"Cindy O. Leander","body":"I had brain fog\/confusion after my second dose and it lasted for weeks. I\nHave recently been diagnosed with high blood pressure and was put on meds. I am petrified of getting a booster.","date":"April 2022","score":"0","source":"fb"},{"author":"Susan Ward","body":"I had Moderna and no side effects.\nCome on people, get the shot so we can get back to living.","date":"April 2022","score":"0","source":"fb"},{"author":"Leenie Hobbie","body":"Completely worth it!","date":"April 2022","score":"0","source":"fb"},{"author":"Crystal Nicole","body":"Still worth it! And I experienced all the side effects!","date":"April 2022","score":"0","source":"fb"},{"author":"Rick Garza","body":"Just asking for a friend.\n\nAnyone else find it strange how COVID can get past 3 vaccines and a booster, but not a thin blue mask? Asking for a friend.","date":"April 2022","score":"0","source":"fb"},{"author":"Laurel Frost Coffey","body":"I had very mild side effects with my booster. Was way easier than my second shot!","date":"April 2022","score":"0","source":"fb"},{"author":"Chris Curren","body":"I had no side effects when I got my first two doses (Pfizer). Hopefully, the same will be true when I get my booster on Friday!","date":"April 2022","score":"0","source":"fb"},{"author":"Wayne Keeton","body":"I'd really like to see Dr Robert Malone and some of your experts sit down and discuss these vaccines.There is way to much confusion that's unprecedented. Would that something you all would ever be open to?","date":"April 2022","score":"0","source":"fb"},{"author":"JoAnne Matters","body":"Or just let the immune system you already have, do it's job! Flu-like symptoms, treat the symptoms!","date":"April 2022","score":"0","source":"fb"},{"author":"Christie Saravo Gisondi","body":"Most common side effect is Covid lol","date":"April 2022","score":"0","source":"fb"},{"author":"Rudy Hernandez","body":"Swelling that occurs in the armpit! Add that one to the list.","date":"April 2022","score":"0","source":"fb"},{"author":"Grateful  Heart","body":"Y'all keep saying that \"your body is building more protection against covid 19\" since the first dose and i dont believed that anymore, i am done with the vaccine, I'm gonna let my body do the job from now on.","date":"April 2022","score":"0","source":"fb"},{"author":"Elliott Plourde","body":"What about myocarditis or brain aneurism 🤷‍♂️","date":"April 2022","score":"0","source":"fb"},{"author":"David Guidry","body":"Don’t forget to expect a case of COVID after your booster...😬","date":"April 2022","score":"0","source":"fb"},{"author":"Irene Pozoukidis","body":"I got chills & a low grade fever, but as a childhood cancer survivor, I am fully invested in preventive health-care. Thank you!","date":"April 2022","score":"0","source":"fb"},{"author":"Mike Brogan","body":"Felt fine after all three injections.","date":"April 2022","score":"0","source":"fb"},{"author":"Kay Knutson","body":"I had flu like symptoms and dizziness that lasted a month! No, thank you to the booster","date":"April 2022","score":"0","source":"fb"},{"author":"Janine Elizabeth","body":"I have lupus and I went into a super flare after my flu shot and a moderate flare after each of my three Pfizers. And I would do it again.","date":"April 2022","score":"0","source":"fb"},{"author":"Lisa Clem Hearn","body":"Add lymph node swelling\/pain and bruising in lymph node area of the armpit.","date":"April 2022","score":"0","source":"fb"},{"author":"Corrine Rushkowski Satriano","body":"You also feel relief, joy and appreciation to the makers of the vaccine and the CDC.\nThanks for all you do.","date":"April 2022","score":"0","source":"fb"},{"author":"Randy Clifford","body":"You left off a sense of security...","date":"April 2022","score":"0","source":"fb"},{"author":"Ivy Dawn Burdette","body":"yes these are only the common ones, no one mentions the ones that aren’t talked about.","date":"April 2022","score":"0","source":"fb"},{"author":"Ginga Ziggy","body":"Just got the booster and only a really sore arm which is to be expected.","date":"April 2022","score":"0","source":"fb"},{"author":"Cathy Wise","body":"i got the booster on wed at 6pm. was down for a day. i then picked up COVID almost immediately. tested positive Tues am. fun times!","date":"April 2022","score":"0","source":"fb"},{"author":"Lori Dufresne","body":"But remember no ventilator if you get the vaccine....win,\nwin","date":"April 2022","score":"0","source":"fb"},{"author":"Scott H. Duke","body":"You guys should really consider disabling comments\/\nreactions.","date":"April 2022","score":"0","source":"fb"},{"author":"Christina Adames","body":"What a relief I was hoping for side effects. Does myocarditis mean it’s working?","date":"April 2022","score":"0","source":"fb"},{"author":"Caitlin Hattrill","body":"Wheres the warning of myocarditis and pericarditis","date":"April 2022","score":"0","source":"fb"},{"author":"Mary Fender","body":"I got all three I had nerve pain that got worse with each one. I am done with any more before it becomes permanent. I can finally walk again without extreme pain","date":"April 2022","score":"0","source":"fb"},{"author":"David Drake","body":"Totally fine after the booster. No side effects whatsoever. None. Thank you!","date":"April 2022","score":"0","source":"fb"},{"author":"Rick Johnson","body":"This message brought to you by Pfizer.","date":"April 2022","score":"0","source":"fb"},{"author":"Jess Español","body":"I am a huge vaccine advocate. Got my first shot and just a sore arm and aches. Second shot same except some tightness in my chest. I should have listened to my body. I had chest tightness and difficulty breathing after the booster to the point I became very worried. Dr recommended an inhaler and medications and it did resolve after that, but my point is if you have had a reaction before don't let anyone bully you into getting the booster. I thought oh I have a degree in public health and am pro vaccine so I HAVE to get it. I still think the vaccine is mostly good but we need to stop shaming people that don't want it. We don't always know why. It was a very scary eye opening experience for me that has helped me to be a little less of a judgemental jerk. We need to have compassion for others regardless of their decision","date":"April 2022","score":"0","source":"fb"},{"author":"James Isidore","body":"If we’re building more protection, why are we still getting covid?!","date":"April 2022","score":"0","source":"fb"},{"author":"Dawn K. Martin","body":"How about death? How come you didn't list that as a side effect???","date":"April 2022","score":"0","source":"fb"},{"author":"Lynn Hanisko McHugh","body":"Had the Moderna vaccine and booster. Slight reactions but I'll take the 1 day of feeling under the weather than get the covid virus anyday!!! The more people who get the vaccines the sooner we could be over all of this. Everyone!","date":"April 2022","score":"0","source":"fb"},{"author":"Ashley Pawlak","body":"Or you could just get the Omnicron cold and not have the extra chemicals in your body - How many more boosters are they gonna have","date":"April 2022","score":"0","source":"fb"},{"author":"Chip Jenkins","body":"I didnt have any side effects at all.","date":"April 2022","score":"0","source":"fb"},{"author":"Barb Stewart Law","body":"I have had tendinitis in both hands for 9 months now post Pfizer.","date":"April 2022","score":"0","source":"fb"},{"author":"Derek Scott","body":"I got the Pfizer booster and the only side effect I had was a raging hardon. Must’ve mixed a little viagra in. 😈","date":"April 2022","score":"0","source":"fb"},{"author":"Stacie Davis Sampson","body":"The stated adverse reactions just in these comments alone is so scary. If you Google search adverse reactions you won’t find anything serious because it’s being deleted… which is SO wrong. People need to know what could happen to them and then make their own decision. I’m not willing to potentially gain long term medical conditions to get this shot.","date":"April 2022","score":"0","source":"fb"},{"author":"Vickie Weiss","body":"And if vaccinated, and boosted... what is the \"mild symptoms of omicron illness\" think I'd skip the booster side effects.","date":"April 2022","score":"0","source":"fb"},{"author":"Anna Wofford","body":"I believe some people really got placebos and some the bad stuff.","date":"April 2022","score":"0","source":"fb"},{"author":"Lori Gramzay Vuljaj","body":"Forgot the others.. stroke.. are arithmia causing a heart attack.. or a chamber misfunction.. leading to massive heart attack.. those are the only ones I know about.. but hey bet everyone else can add to it.. and my recap .. was more than one person each","date":"April 2022","score":"0","source":"fb"},{"author":"Tammy Allday","body":"I have had Covid variants 1,2, and 3 and I will not get this stupid \"vaccine\"...peo\nple, you sound so dumb even calling it a vaccine when it does not provide immunity to the disease! I did get pretty sick the 1st go with it but no hospitalized sick and then variants 2 and 3, my dr prescribed ivermectin and I was well in a matter of days with minimal symptoms...ill take my chances","date":"April 2022","score":"0","source":"fb"},{"author":"Jennifer Lehman","body":"I must be immortal now. After the Moderna booster I was sick for 10 days. My injection site was beet red and spread into my upper back. I had a headache for about 2 weeks.","date":"April 2022","score":"0","source":"fb"},{"author":"Kathy Sears","body":"Almost all of them for me, but well worth the few hours to be able to lessen any effects I might get from the virus, if I get it!","date":"April 2022","score":"0","source":"fb"},{"author":"Lisa Price Spainhour","body":"I didn't get any side effects from all 3. Hubby just got a sore arm after 2nd one. We got Pfizer.","date":"April 2022","score":"0","source":"fb"},{"author":"Tran TL Hong","body":"Headaches that last for almost a Year for my mom and she’s in the Er every month! My clients having nerve problems from the second went away then her booster it came back again.","date":"April 2022","score":"0","source":"fb"},{"author":"Rick Weber","body":"A lesser mentioned but prevalent side effect is, quite apparently, mass formation psychosis.","date":"April 2022","score":"0","source":"fb"},{"author":"Heather Migliozzi","body":"So other than the injection site, you will experience symptoms of having COVID. Got it. 🤦🏼‍♀️","date":"April 2022","score":"0","source":"fb"},{"author":"Mike Sims","body":"I just had a sore arm, I had all three shots so far and no COVID! I hope I didn’t just jinx myself","date":"April 2022","score":"0","source":"fb"},{"author":"Terry Cabaniss","body":"Very minimal side effects with both vaccines- little lethargic and a sore arm but nothing major. I did contract COVID 3 weeks ago - it happens. Very rough for 3 days and the tiredness takes a while to get over but each day a little better 😉. I have my booster scheduled for Thursday. Not afraid at all about it and I know it’s the right thing to protect myself and others. I do believe it will be a long term booster (ie Tetnus) but a yearly booster. Stay well and positive all❤️","date":"April 2022","score":"0","source":"fb"},{"author":"Oralene Whitlow","body":"Slight headache after the two first ins nothing but a sore arm after the booster and I'm 78 years old and I would do it all over again","date":"April 2022","score":"0","source":"fb"},{"author":"Norē Díaz","body":"Basically same as Omicrom","date":"April 2022","score":"0","source":"fb"},{"author":"Eileen Hart St. John","body":"I had no side effects at all with my booster. Minor tenderness at shot site. Please be sure to hydrate well before and after. It really makes a difference.👍😁","date":"April 2022","score":"0","source":"fb"},{"author":"Christopher Alksnis","body":"I had zero side effects from J&J. Moderna (full dose) booster shot I had fatigue for a week. But since we're likely to have to have more boosters, if it prevents Covid-19, it's worth it.","date":"April 2022","score":"0","source":"fb"},{"author":"Laina Carr","body":"I had almost all of these with my Moderna booster! But yet it doesn’t feel like a real sickness if that makes sense?? Anyways it was all worth it not bad at all","date":"April 2022","score":"0","source":"fb"},{"author":"Josh Parazine","body":"I have non stop diarrhea after the shot...also before the shot i had non stop diarrhea..so maybe not related","date":"April 2022","score":"0","source":"fb"},{"author":"Carlos Castellanos","body":"Got my booster shot , Moderna, no side affects whatsoever for me","date":"April 2022","score":"0","source":"fb"},{"author":"Brooke Siegel","body":"My arm was burning up for 5 days after my booster. I don’t mean pain, I mean I could literally fry an egg on my arm it was so hot compared to my other arm.","date":"April 2022","score":"0","source":"fb"},{"author":"Rachael Hitt","body":"Got a nice big blister at the injection site the second and third shot. Of course I popped it. The MD said I had a reaction to it. Of course I reported this.","date":"April 2022","score":"0","source":"fb"},{"author":"Kerry Tebbe Sr.","body":"I'm done with the vaccine's. Enough already.","date":"April 2022","score":"0","source":"fb"},{"author":"Marie Kruger","body":"I WILL NOT GET A BOOSTER SHOT BECAUSE I HAD A BAD SIDE EFFECT FROM THE 2ND SHOT FOR 8 WEEKS SO THAT'S THAT\nNO MORE !","date":"April 2022","score":"0","source":"fb"},{"author":"Sandra Steinberg Linenschmidt","body":"Not necessarily. If you keep yourself well hydrated and or using vitamin D3 zinc B12 Etc you were protecting your self. Thankfully I had no side effects of the covid vaccines but I did feel a little ill after my flu vaccine.","date":"April 2022","score":"0","source":"fb"},{"author":"Hung Ho","body":"You can never hear the bad side effects because they deleted them all.","date":"April 2022","score":"0","source":"fb"},{"author":"Stephanie Chandler","body":"I feel a bit yucky.\nGot mine just the other day\nWell worth it.","date":"April 2022","score":"0","source":"fb"},{"author":"LyNelle Brennecke","body":"It’s a bit scary when some of the side affects of getting the shot are the same as if you got Covid with the exception of only a couple.","date":"April 2022","score":"0","source":"fb"},{"author":"Darleen Wirasnik Crews","body":"I had the Pfizer! Absolutely not one side effect from any of the shots.","date":"April 2022","score":"0","source":"fb"},{"author":"Adan Marquez","body":"So if you are unvaccinated you could catch and spread the virus, But if you're vaccinated you can catch and spread the virus... But you're vaccinated! Ahhhhhhh makes since! 🙄","date":"April 2022","score":"0","source":"fb"},{"author":"R. Daniel Hague","body":"Don't get mad at the trolls in this thread. Why else would someone come to the CDC site and spew ignorance. We come looking for guidance from a trusted source. Trolls are waiting for us. Better to ignore them.","date":"April 2022","score":"0","source":"fb"},{"author":"Kayla Garner Lane","body":"When it enough and stand up and fight back , if we let the government take over we are f vaccinated and unvaxed it time to stand","date":"April 2022","score":"0","source":"fb"},{"author":"Myrna Tabalba","body":"Thanks God 😊 I never had any side effects of the vaccine and I just got my booster too last week. ..","date":"April 2022","score":"0","source":"fb"},{"author":"Bridget Sharkey","body":"No thank you! And I’m Rolling my eyes after reading a bunch of the comments- a bunch of side effects and people are still “ grateful “ and going for more shots. Crazy","date":"April 2022","score":"0","source":"fb"},{"author":"Jessica Kelly","body":"I had the tiredness real bad and I worked a 12 hour over night shift that’s same night and had to leave at 5am I was wiped right out! But it didn’t last long!!","date":"April 2022","score":"0","source":"fb"},{"author":"Gutierrez L Brenda","body":"I had Covid, what’s the difference? I had the exact same symptoms minus the pain in the injection site. Now I have stronger and longer immunity.","date":"April 2022","score":"0","source":"fb"},{"author":"Lily Dunn","body":"But ok I want to try to understand if you take an Advil or ibuprofen before or after? The vaccine shot or booster and will it help you prevent a fever or no","date":"April 2022","score":"0","source":"fb"},{"author":"Allie Whitten","body":"Felt fine after all 3 as did my 30 year old husband and 8 year old son.","date":"April 2022","score":"0","source":"fb"},{"author":"Sam Foulks","body":"I had a swollen lymph node for about 3 days it got so bad I couldnt lift my arm. I had to have a coworker drive me to work. Still better than catching covid though!","date":"April 2022","score":"0","source":"fb"},{"author":"Dawn Simm","body":"The people I know who currently have Covid had their booster shot shortly before. Hmmm","date":"April 2022","score":"0","source":"fb"},{"author":"Corine LeMaster Pitts","body":"Worth 24 hrs of discomfort","date":"April 2022","score":"0","source":"fb"},{"author":"Elizabeth Neal Koryciak","body":"I had none of these, neither did any of my family.","date":"April 2022","score":"0","source":"fb"},{"author":"Chae Raybern","body":"Some people get severe reactions sick for week with headaches body aches","date":"April 2022","score":"0","source":"fb"},{"author":"KristalN'Scott Johnson","body":"why do you need more if you already have them building in your body","date":"April 2022","score":"0","source":"fb"},{"author":"Rondell Daniel","body":"Good luck to u all...\nThank u CDC for at least trying to keep some ppl safe💪🏾✌🏾","date":"April 2022","score":"0","source":"fb"},{"author":"ReNee Tracy","body":"Or you may end up with heart problems (as I did, no previous health issues) This is an individual choice. Listen to your gut. I shouldn’t have had the poke.","date":"April 2022","score":"0","source":"fb"},{"author":"Jenny Linstrom","body":"I believe your missing a lot more side effects, heart attacks, paralysis and death. You know big important ones your hiding.","date":"April 2022","score":"0","source":"fb"},{"author":"Jessica Herd","body":"The fact I couldn’t turn my neck either way for a week after my first dose says a lot. Not normal indeed.","date":"April 2022","score":"0","source":"fb"},{"author":"Pamela Falls","body":"I know someone that has to put drops in his eyes for glaucoma and his doctor said it probably wouldn't be good for him to take the shot, and I use the same drops for my eyes, but I haven't had the shot and neither has he","date":"April 2022","score":"0","source":"fb"},{"author":"Erica Clayton","body":"Sue Dunham Danielson there is no vaccine approved for rheumatic fever😐 I have no problem with covid 19 vax and am fully vaccinated, but it is definitely proving to be much less effective than hoped. I do think it helps lessen severity of symptoms and so far hospitalization\ns. I hope that continues into the future, but it's really too early to say.","date":"April 2022","score":"0","source":"fb"},{"author":"Sandra Arroyo","body":"I put on a modern booster and the only thing that I felt a little pain in the armpits but a tylenol for 2 days every 4 hours and solved I'm fine","date":"April 2022","score":"0","source":"fb"},{"author":"Janet Helwagen Moran","body":"Thanks for trying to help us stay safe and healthy.","date":"April 2022","score":"0","source":"fb"},{"author":"Mirjam Engelsman","body":"You visualize it correctly. My compliments!","date":"April 2022","score":"0","source":"fb"},{"author":"Lindsay Barreto","body":"Why is it called a vaccine if you can still get covid? Shouldn’t it be called an immunotherapy instead?","date":"April 2022","score":"0","source":"fb"},{"author":"Marla Swanson","body":"Minor side effects lasting 24-72 hrs from all 3 Moderna for me, but well worth it!","date":"April 2022","score":"0","source":"fb"},{"author":"Barbara Salley","body":"I had NO side effects from any of the vaccines or boosters What bothers me more than \"anything\" is that people act they're dying from shots that we NEED. So many symptoms - so many complaints. What will ultimately happen because of so many complaints is that these cures will have to be taken off the market then we all suffer and die. My God grow up people - GROW UP!!!!! All of you are NOT really suffering.","date":"April 2022","score":"0","source":"fb"},{"author":"Mary Ellen Jeno","body":"I have some of these side effects. Better than getting Covid.","date":"April 2022","score":"0","source":"fb"},{"author":"Cheryl Dumont","body":"No thanks. Body swelling is not what I want after mine did after the first shot. J J","date":"April 2022","score":"0","source":"fb"},{"author":"Rachelle Carney","body":"Also add - Hugely inflamed lymph node of injected arm for a few days 😰😣 Ouch!","date":"April 2022","score":"0","source":"fb"},{"author":"Daniela Leal","body":"Received third booster of moderna. Side effects mild.\nFeeling perfectly fine. And ready to go back to work with children.","date":"April 2022","score":"0","source":"fb"},{"author":"Tycee Davis","body":"I had no side effects with my booster other than a massive bruise down my arm. My husband woke up at 2am every morning for 2 weeks after his booster then it went away. We had the Moderna.","date":"April 2022","score":"0","source":"fb"},{"author":"Katie Fuller Barnes","body":"I had a sore arm from the shots. My husband has had fever and chills. It's different for people, but worth it.","date":"April 2022","score":"0","source":"fb"},{"author":"Victoria A Pleszkoch-Rafferty","body":"I had my booster… no reaction. 👍 GET Your Booster!","date":"April 2022","score":"0","source":"fb"},{"author":"Kristen Glover","body":"Great! Exactly what Covid feels like! So what’s the point of a booster if you have had the last strain?","date":"April 2022","score":"0","source":"fb"},{"author":"Jennifer Johanning","body":"1st 2 were rough, (still totally worth it). The booster not nearly as bad! No fever this time, but my body felt like I played 7 softball games in 1 day lol! I had Moderna all 3 times","date":"April 2022","score":"0","source":"fb"},{"author":"Jackie Russo","body":"I had a sore arm for one day. It was the best experience of the series of vaccines I've had.","date":"April 2022","score":"0","source":"fb"},{"author":"Carol Kolcz","body":"I had heart palpitations a week or 2 after the 2nd vaccine. I kept having them, only worse over time and more frequently ever since. I am told I have afib. Related to vaccine? They will never admit it. I'm not getting the booster.","date":"April 2022","score":"0","source":"fb"}]