[{"author":"spaniel_rage","body":"The CDC seems to think it's unlikely this safety signal is going to turn out to be real.\n\n\"The findings prompted officials to look for similar findings. CDC officials conducted a different analysis in the Vaccine Safety Datalink system, using the same data but different methodology, and were not able to replicate the finding. Officials also searched other systems, including those of Medicare, the Department of Veterans Affairs and Pfizer’s global surveillance network. Regulators in other countries, including Israel, also were consulted, but no evidence of similar findings emerged, the officials said.\nThe statement from the two agencies said that the government uses multiple systems to detect potential safety problems and that “often these safety systems detect signals that could be due to factors other than the vaccine itself.”\n\nhttps:\/\/www.washingtonpost.com\/health\/2023\/01\/13\/pfizer-covid-vaccine-safety\/","score":10,"date":"Jan 2023","source":"reddit"},{"author":"pharmaboy2","body":"I’m a little troubled that the CDC reported the safety signal and then immediately reported other databases taht showed no signal .   They are trying to minimise it - quite honestly, that’s exactly what we in the Pharma industry would do.\n\nIn a more neutral world where these things don’t get in the media, we publish the signal in order to get others to look for the signal in their own databases.\n\nIt’s amazing how many times a single database picks it up, but no pick ups anywhere else until 6 months after publishing .  Clinicians need to be aware - it seems a rather defensive release from the CDC - which I fully understand as to why, but still the cdc should ignore the gallery ( I really hate to say it - peanuts )\n\nIt is 100% reasonable to be cynical of a Pharma company saying we don’t think it’s real ..,,","score":8,"date":"Jan 2023","source":"reddit"},{"author":"None","body":"I would not trust a large pharmaceutical company to provide such data when their interest is clearly for their own corporations profits and capital gain. That is an extreme conflict of interest.\n\nUpdate: I’m unsure why someone would downvote my comment, considering it’s common sense to avoid conflict of interest? Conflict of interest leads to unreliable data. Zero bad intentions, just a friendly comment to help us form the best piece of information and make good judgements…","score":11,"date":"Jan 2023","source":"reddit"},{"author":"sacre_bae","body":"Good","score":3,"date":"Jan 2023","source":"reddit"},{"author":"Mymerrybean","body":"[Pfizer Document 5.3.6](https:\/\/www.phmpt.org\/wp-content\/uploads\/2022\/04\/reissue_5.3.6-postmarketing-experience.pdf) A cummulative analysis of post authorisation adverse events, reported 275 people who suffered a stroke suspected to have been attributed to the vaccine within 41 days, of those ~50% occurred within 48 hours after injection. \n\nUnfortunately the monitoring stopped at the end of the 90 day period, however the fact that the CDC has now after 2 years decided that there might be enough of a safety signal to publicly announce an investigation into vaccine induced strokes seems very unfortunate, given this safety signal was present within the first few months post authorisation **more than 2 years ago**.\n\nEDIT: \"suspected to have been attributed to\"","score":3,"date":"Jan 2023","source":"reddit"},{"author":"CoronavirusDownunder-ModTeam","body":"Thank you for contributing to r\/CoronavirusDownunder.\n\nUnfortunately your submission has been removed as a result of the following rule:\n\n\n* **Do not encourage or incite drama**. This may include behaviours such as:\n\n    * Making controversial posts to instigate or upset others.\n    * Engaging in bigotry to get a reaction.\n    * Distracting and sowing discord with digressive and extraneous submissions.\n    * Wishing death upon people from COVID-19.\n    * Harmful bad faith comparisons; for example comparing something to the holocaust, assault or reproductive autonomy.\n    * Repeat or extreme offending may result in a ban.\n\nOur community is dedicated to collaboration and sharing information as a community. Don't detract from our purpose by encouraging drama among the community, or behave in any way the detracts from our focus on collaboration and information exchange.\n\n\n\n\nIf you believe that we have made a mistake, please [**message the moderators**](https:\/\/www.reddit.com\/message\/compose?to=%2Fr%2FCoronavirusDownunder&subject=&message=).\n\n^To ^find ^more ^information ^on ^the ^sub ^rules, ^please ^click ^[here](https:\/\/www.reddit.com\/r\/CoronavirusDownunder\/about\/rules\/).","score":1,"date":"Jan 2023","source":"reddit"},{"author":"CoronavirusDownunder-ModTeam","body":"Thank you for contributing to r\/CoronavirusDownunder.\n\nUnfortunately your submission has been removed as a result of the following rule:\n\n\n* **Information about vaccines and medications should come from quality sources**, such as recognised news outlets, academic publications or official sources.\n* The rule applies to all vaccine and medication related information regardless of flair.\n* Extraordinary claims made about vaccines should be substantiated by a quality source\n* Comments that deliberately misrepresent sources may be removed\n\n\n\nIf you believe that we have made a mistake, please [**message the moderators**](https:\/\/www.reddit.com\/message\/compose?to=%2Fr%2FCoronavirusDownunder&subject=&message=).\n\n^To ^find ^more ^information ^on ^the ^sub ^rules, ^please ^click ^[here](https:\/\/www.reddit.com\/r\/CoronavirusDownunder\/about\/rules\/).","score":2,"date":"Jan 2023","source":"reddit"},{"author":"spaniel_rage","body":"I'm sceptical of anything Pfizer are saying on the matter, but it's pretty reassuring if there is no signal in the Medicare or VA database, or from Israel or the EU. I get that they are erring on the side of full transparency. It's just dismaying that a story like this gets leaped upon by every antivaxxer and their dog.","score":7,"date":"Jan 2023","source":"reddit"},{"author":"spaniel_rage","body":"None of the data sources listed above are paid for or managed by the pharmaceutical companies.","score":16,"date":"Jan 2023","source":"reddit"},{"author":"Individual-Parking-5","body":"Did you even read it? They have combed through everything they could get their hands on.","score":2,"date":"Jan 2023","source":"reddit"},{"author":"chessc","body":"This is plain wrong.\n\n>reported 275 people who suffered a stroke **attributed** to the vaccine within 41 days, of those ~50% occurred within 48 hours after injection\n\nIt is deceptive to claim these strokes were \"attributed\" to the vaccine. The documents you link to do not say this. They are adverse events, which means they occurred after vaccination, but not necessarily caused by vaccination. The Pfizer documents cover a period of time where tens of millions of vaccine doses were administered. Unfortunately, everyday there are people who have strokes. And it's more likely among elderly people, who were a priority group for the early phases of the vaccine rollout (and who make up the majority of the reported adverse events.) There's only a safety signal if the number of adverse events is higher than the number of expected background events. There was no safety signal for this data.\n\nI believe this has been explained to you before.","score":3,"date":"Jan 2023","source":"reddit"},{"author":"spaniel_rage","body":"No.\n\nYou're inaccurately editorialising what that document reports.\n\nThe adverse events listed in that paper are *not* attributed to the vaccine. They were observed in the population of 126M administred doses within 90 days. Causality is not necessarily implied. In a population that large, you *are* going to observe the normal background rate of disease incidence.\n\n275 strokes in 126M individuals is not outside of the predicted background rate.","score":4,"date":"Jan 2023","source":"reddit"},{"author":"giantpunda","body":">61 people suffered stroke in the US within 48 hours of getting the first dose\n\nThat's a hell of a stat to throw out there without any source for that claim.\n\nDo you have one?","score":3,"date":"Jan 2023","source":"reddit"},{"author":"pharmaboy2","body":"I think the problem here is that you find it “reassuring’ , which is generally an emotion and exactly what I’d expect as the takeaway from\nThe release (is it 2 weeks ago now?)\n\nI’m not throwing stones at you - my criticism is that is exactly the intent. Exactly how I’d put it together if I was head of clincal at Pfizer.  Gee, it wasn’t that long ago that the regs were scrupulously neutral in their language and left it to others.\n\nIn all likelihood, I don’t expect this SS to have any substance given the coding for such events and that’s as someone who watched a nearest and dearest have AZ and stroked 6 days later - passed 4 days later, but in the first person we do tend to link things that are not related .\n\nStrong data helps with this tendency","score":5,"date":"Jan 2023","source":"reddit"},{"author":"None","body":"“Pfizer’s Global Surveillance Program” is not independent of Pfizer as it reads. An independent body gives better insight and judgement of how data is liaised and corresponded. I’m not suggesting it’s completely incorrect, what I’m questioning is the integrity of a corporation providing such data when it’s their own product sold for profit.\n\nYes, I’m fully vaccinated and happy to be, but open to all information and question for better outcomes of risks vs benefits for vaccination for COVID-19.","score":4,"date":"Jan 2023","source":"reddit"},{"author":"None","body":"Of course, but that doesn’t prevent the question - why is there a conflict of interest disrupting the data?","score":3,"date":"Jan 2023","source":"reddit"},{"author":"pharmaboy2","body":"Did you ask “why”?\n\nAnd is combing through normal before releasing a safety signal?","score":-1,"date":"Jan 2023","source":"reddit"},{"author":"Mymerrybean","body":"My wording says \"attributed to\" should have be \"suspected to have been attributed to\" will edit, it's also noted that the \"magnatude of underreporting is unknown. I would watch this space.","score":0,"date":"Jan 2023","source":"reddit"},{"author":"Mymerrybean","body":"Removed as I got the figures wrong, will come back with the actual figures.","score":-1,"date":"Jan 2023","source":"reddit"},{"author":"spaniel_rage","body":"The VAERS, Medicare and VA database mentioned above, as well as the TGA and equivalent bodies in the UK, EU and Israel, are entirely independent of Pfizer.\n\nYes, we rely on them for phase 2\/3 data, but not for this kind of phase 4 data.","score":16,"date":"Jan 2023","source":"reddit"},{"author":"Rupees_Gains","body":"Of course you would \"watch this space\". When it doesn't eventuate, you will shift the goal posts. Or claim that the data is flawed. Or switch to a new claim.","score":2,"date":"Jan 2023","source":"reddit"},{"author":"sacre_bae","body":"I already ran the numbers on this one.\n\n\nThere’s about 2160 strokes per day in the US, or 45,360 in any given 21 day period. About 62% occur in people 65+, so around 28,123.\n\nAbout 56m people are aged over 65, and 550,000 is 1 \/ 102nd of that.\n\n28123 \/ 102 = 276.\n\nSo you would expect a background rate of 276 strokes in that vaccinated group in this time period.\n\n\nThe CDC observed 130 strokes in that time period.","score":5,"date":"Jan 2023","source":"reddit"},{"author":"Rupees_Gains","body":"Uhhhh no. Your SOURCE wasn't removed. Your false, unsupported claim, was removed.","score":2,"date":"Jan 2023","source":"reddit"},{"author":"None","body":"Thank you, great response. Those independent bodies are much better sources of data than the product’s own surveillance network.","score":2,"date":"Jan 2023","source":"reddit"},{"author":"Mymerrybean","body":"See response here, with [source](https:\/\/www.phmpt.org\/wp-content\/uploads\/2022\/04\/reissue_5.3.6-postmarketing-experience.pdf).\nhttps:\/\/www.reddit.com\/r\/CoronavirusDownunder\/comments\/10bwiuy\/comment\/j4g071f\/?utm_source=share&utm_medium=web2x&context=3\n\nBTW - I meant that I removed my comment, as I needed to clarify, it wasnt removed by moderators.","score":0,"date":"Jan 2023","source":"reddit"},{"author":"pharmaboy2","body":"They may be- but Pharma companies run pretty good surveillance -  far broader than the official reporting systems.  Personally, I reject the notion that Pharma companies can bury a signal or that it’s tainted due to source.   Pharma would never report like this has been though - you don’t tell people here it it but we investigated it and it’s nothing \n\nI would bet pounds to peanuts that the EMA doesn’t respond in this way , nor in fact Pfizer (who will tread far more carefully here)","score":1,"date":"Jan 2023","source":"reddit"}]